RegulusApple/MSPM0G3507_64pin_total_test/mspm0_g3507.syscfg
/* Frequency meter: TIMG12 32-bit PERIOD capture on PB13 (free pin).
 * Period capture measures the time between two consecutive input edges in
 * hardware, so no ISR reload is needed and interrupt latency does not skew
 * the measurement (unlike EDGE_TIME which needs a manual reload). */
CAPTURE1.$name                      = "FREQ_CAPTURE";
CAPTURE1.timerClkSrc                = "BUSCLK";
CAPTURE1.timerClkDiv                = 1;
CAPTURE1.timerClkPrescale           = 1;
CAPTURE1.timerPeriod                = "1 s";
CAPTURE1.captMode                   = "PERIOD_CAPTURE";
CAPTURE1.interrupts                 = ["CC0_DN","ZERO"];
CAPTURE1.peripheral.$assign         = "TIMG12";
CAPTURE1.peripheral.ccp0Pin.$assign = "PB13";
CAPTURE1.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinFreqCap0";

/* Square-wave generator: TIMG7 PWM edge mode, 50% duty, PB15 out (free pin). */
PWM1.$name                      = "SQUARE_TIMER";
PWM1.clockPrescale              = 1;
PWM1.timerCount                 = 32000;
PWM1.ccIndex                    = [0];
PWM1.peripheral.$assign         = "TIMG7";
PWM1.peripheral.ccp0Pin.$assign = "PB15";
PWM1.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinSquare0";
PWM1.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerSquareCC0";
PWM1.PWM_CHANNEL_0.dutyCycle    = 50;
PWM1.PWM_CHANNEL_0.ccValue      = 16000;

/* General PWM output: TIMA0 CCP1 on PA9 (free pin). */
PWM2.$name                      = "PWM_TIMER";
PWM2.clockPrescale              = 1;
PWM2.timerCount                 = 32000;
PWM2.ccIndex                    = [1];
PWM2.peripheral.$assign         = "TIMA0";
PWM2.peripheral.ccp1Pin.$assign = "PA9";
PWM2.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinPwm1";
PWM2.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerPwmCC1";
PWM2.PWM_CHANNEL_1.dutyCycle    = 50;
PWM2.PWM_CHANNEL_1.ccValue      = 16000;

/* CV/CC control tick: TIMG6 periodic 50 us (20 kHz) zero-event interrupt. */
TIMER2.$name                      = "PSU_CTRL_TIMER";
TIMER2.timerMode                  = "PERIODIC";
TIMER2.timerStartTimer            = false;
TIMER2.timerPeriod                = "50 us";
TIMER2.interrupts                 = ["ZERO"];
TIMER2.peripheral.$assign         = "TIMG6";

/* RTC on default LFCLK (calendar readout for MeterRecord timestamps). */
RTC.calYear            = 2026;
RTC.calMonth           = "1";
RTC.calDOM             = 1;
RTC.calHour            = 0;
RTC.calMin             = 0;
RTC.calSec             = 0;
RTC.peripheral.$assign = "RTC";

/* OPA1 non-inverting PGA 2x: IN0+=PB19, OUT=PA16 (both free).  The inverting
 * input is the internal RTAP ladder (NSEL=RTAP), no external pin needed. */
OPA1.$name                        = "OPA_0";
OPA1.cfg0OutputPin                = "ENABLED";
OPA1.cfg0PSELChannel              = "IN0_POS";
OPA1.cfg0NSELChannel              = "RTAP";
OPA1.cfg0MSELChannel              = "GND";
OPA1.cfg0Gain                     = "N1_P2";
OPA1.peripheral.$assign           = "OPA1";
OPA1.peripheral.In0PosPin.$assign = "PB19";
OPA1.peripheral.OutPin.$assign    = "PA16";

/* COMP1 threshold comparator: IN0+=PB26, IN0-=PB27 (both free). */
COMP1.$name                      = "COMP_0";
COMP1.compMode                   = "DL_COMP_MODE_FAST";
COMP1.hysteresis                 = "DL_COMP_HYSTERESIS_NONE";
COMP1.vSource                    = "DL_COMP_REF_SOURCE_VDDA_DAC";
COMP1.controlSelect              = "DL_COMP_DAC_CONTROL_SW";
COMP1.channelEnable              = ["POS","NEG"];
COMP1.enabledInterrupts          = ["DL_COMP_INTERRUPT_OUTPUT_EDGE"];
COMP1.peripheral.$assign         = "COMP1";
COMP1.peripheral.compPinPos0.$assign = "PB26";
COMP1.peripheral.compPinNeg0.$assign = "PB27";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Board.peripheral.$suggestSolution                     = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution            = "PA20";
Board.peripheral.swdioPin.$suggestSolution            = "PA19";
DAC12.peripheral.$suggestSolution                     = "DAC0";
DAC12.peripheral.OutPin.$suggestSolution              = "PA15";
